app/controllers/scores_controller.rb

  def index
    @scores = Score.all
---
SELECT "scores".* FROM "scores" ORDER BY score, DESC

  def show
    @score = Score.find(params[:id])
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @score = Score.new(params[:score])

    respond_to do |format|
      if @score.save
---
INSERT INTO "scores" ("created_at", "name", "score", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 04 May 2012 19:21:42 UTC +00:00], ["name", "richie"], ["score", 12345], ["updated_at", Fri, 04 May 2012 19:21:42 UTC +00:00]]

  def destroy
    @score = Score.find(params[:id])
    @score.destroy
---
SELECT "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 2]]